lvx/base/Documents/бит_кзн_РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_РеестрПлатежей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_РеестрыПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПлатежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежнаяПозиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаПлатежнаяПозиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОдиночнаяПозиция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаблокироватьСтроку</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/CommonModules/бит_МобильноеПриложениеУП/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыОбъектовДляОтображенияОстатков() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств");
	
	Возврат Результат;
	
КонецФункции 

Функция ТипыОбъектовДляОтображенияТабличныхЧастей() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ДокументСсылка.бит_АктуализацияБюджета");
	Результат.Добавить("ДокументСсылка.бит_ВерсияОтчета");
	Результат.Добавить("ДокументСсылка.бит_ДополнительныеУсловияПоДоговору");
	Результат.Добавить("ДокументСсылка.бит_КорректировкаБюджета");
	Результат.Добавить("ДокументСсылка.бит_КорректировкаКонтрольныхЗначений");
	Результат.Добавить("ДокументСсылка.бит_ФормаВводаБюджета");
	Результат.Добавить("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств");
	Результат.Добавить("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств");
	Результат.Добавить("ДокументСсылка.бит_кзн_РеестрПлатежей");

	Возврат Результат;
	
КонецФункции 

Функция ПолучитьДанныеФайлаОбъекта(ИмяОбъекта, Идентификатор) Экспорт
	
	ИмяХранилищаФайлов = ИмяОбъекта+"ПрисоединенныеФайлы";
	ФайлСсылка         = Справочники[ИмяХранилищаФайлов].ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	
	Результат = Новый Структура;
	Результат.Вставить("ID");
	Результат.Вставить("VersionID");
	Результат.Вставить("Data");
	Результат.Вставить("Message");
	Результат.Вставить("StatusCode");
	Если ОбщегоНазначения.СсылкаСуществует(ФайлСсылка) Тогда
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(ФайлСсылка);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);		
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			Результат.ID         = Идентификатор;
			Результат.VersionID  = XMLСтрока(ФайлСсылка);
			Результат.Data       = Base64Строка(ДвоичныеДанные);
			Результат.Message    = "OK";
			Результат.StatusCode = 200;
		Иначе	
			Результат.Message    = "Cannot get file data";
			Результат.StatusCode = 500;
		КонецЕсли; 
	Иначе	
		ТекстСообщения        = "Cannot find file by ID %1";
		ТекстСообщения        = СтрШаблон(ТекстСообщения, Идентификатор);
		Результат.Message     = ТекстСообщения;
		Результат.StatusCode  = 404;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция УникальнаяТабличнаяЧасть(Ссылка, ДопАналитики) Экспорт

	Результат = "";	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.бит_кзн_РеестрПлатежей") Тогда
		Результат = HTMLРеестра(Ссылка);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств")
		ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда	
		Результат = HTMLЗаявки(Ссылка, ДопАналитики);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НеобходимКомментарийЗадача(Организация, ОбъектСистемы, ВидРешения) Экспорт

	Результат = Новый Структура("ЗаписьСуществует, НеобходимКомментарийЗадача", Ложь, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидРешения",    ВидРешения);
	Запрос.УстановитьПараметр("ОбъектСистемы", ОбъектСистемы);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыРешенийСогласования.Организация КАК Организация,
	|	ВидыРешенийСогласования.ОбъектСистемы КАК ОбъектСистемы,
	|	ВидыРешенийСогласования.ВидРешения КАК ВидРешения,
	|	ВидыРешенийСогласования.НеобходимКомментарийЗадача КАК НеобходимКомментарийЗадача
	|ИЗ
	|	РегистрСведений.бит_НазначениеВидовРешенийСогласования КАК ВидыРешенийСогласования
	|ГДЕ
	|	ВидыРешенийСогласования.Организация = &Организация
	|	И ВидыРешенийСогласования.ОбъектСистемы = &ОбъектСистемы
	|	И ВидыРешенийСогласования.ВидРешения = &ВидРешения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.ЗаписьСуществует = Истина;
		Результат.НеобходимКомментарийЗадача = Выборка.НеобходимКомментарийЗадача;
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция ЭтоСправочник(Значение) Экспорт
	
	Результат = Ложь;
	СправочникиВизирования = Новый Массив();
	СправочникиВизирования.Добавить("ДоговорыКонтрагентов");
	СправочникиВизирования.Добавить("ДоговорыКредитовИДепозитов");
	СправочникиВизирования.Добавить("ДоговорыАренды");
	СправочникиВизирования.Добавить("СоглашенияСКлиентами");
	СправочникиВизирования.Добавить("СоглашенияСПоставщиками");
	Если СправочникиВизирования.Найти(Значение) <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипыОбъектов() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить(Тип("ДокументСсылка.бит_ФормаВводаБюджета"));
	Результат.Добавить(Тип("ДокументСсылка.бит_АктуализацияБюджета"));
	Результат.Добавить(Тип("ДокументСсылка.бит_КорректировкаБюджета"));
	Результат.Добавить(Тип("ДокументСсылка.бит_ВерсияОтчета"));
	Результат.Добавить(Тип("ДокументСсылка.бит_КорректировкаКонтрольныхЗначений"));
	Результат.Добавить(Тип("ДокументСсылка.бит_ДополнительныеУсловияПоДоговору"));
	Результат.Добавить(Тип("ДокументСсылка.бит_БюджетнаяОперация"));
	Результат.Добавить(Тип("ДокументСсылка.бит_ПротоколРасхожденийБюджета"));
	Результат.Добавить(Тип("ДокументСсылка.бит_мдм_ЗаявкаНаИзменение"));
	Результат.Добавить(Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств"));
	Результат.Добавить(Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств"));
	Результат.Добавить(Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств"));
	Результат.Добавить(Тип("ДокументСсылка.бит_кзн_РеестрПлатежей"));
	Результат.Добавить(Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию"));
	Результат.Добавить(Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты"));
	Результат.Добавить(Тип("ДокументСсылка.бит_пз_СводнаяЗаявкаНаЗатраты"));
	Результат.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	Результат.Добавить(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
	Результат.Добавить(Тип("СправочникСсылка.ДоговорыАренды"));
	Результат.Добавить(Тип("СправочникСсылка.СоглашенияСКлиентами"));
	Результат.Добавить(Тип("СправочникСсылка.СоглашенияСПоставщиками"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоРеестр(Ссылка) Экспорт
	
	Результат = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.бит_кзн_РеестрПлатежей") Тогда
		Результат = Истина
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ЕстьУникальнаяТабличнаяЧасть(Ссылка) Экспорт
	
	Результат = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.бит_кзн_РеестрПлатежей")
		ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств")
		ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
		Результат = Истина
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Процедура ДополнитьДанныеОбъекта(ДанныеОбъекта, Источник, ЗапросПлатежнойПозиции, ЭтоЗадача) Экспорт 
	
	Если ЗапросПлатежнойПозиции <> Неопределено
		И ТипЗнч(Источник.ОбъектВизирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		ЗапросПлатежнойПозиции.УстановитьПараметр("ДокументПланирования", Источник.ОбъектВизирования);
		Выборка = ЗапросПлатежнойПозиции.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДанныеОбъекта.PaymentDate = Формат(Выборка.ДатаПлан, "ДЛФ=D");
		КонецЕсли;
	КонецЕсли;
	
	ДанныеОбъекта.Executor = Строка(Источник.Инициатор);
	Если ТипЗнч(Источник.ОбъектВизирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		Если ЗначениеЗаполнено(Источник.ОснованиеПланирования)
			И Источник.ОснованиеПланирования = Перечисления.бит_кзн_ВидыПланов.Прогноз Тогда
			ДанныеОбъекта.BasisForecast = Истина;
		Иначе
			ДанныеОбъекта.BasisForecast = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьДаннымиРеестраПлатежей(ОбъектВизирования, Источник) Экспорт
	
	Если ТипЗнч(Источник.ОбъектВизирования) = Тип("ДокументСсылка.бит_кзн_РеестрПлатежей") Тогда
		ДанныеРеестра = Новый Структура;
		ДанныеРеестра.Вставить("ID",           XMLСтрока(Источник.ОбъектВизирования));
		ДанныеРеестра.Вставить("Number",       Источник.Номер);
		ДанныеРеестра.Вставить("Date",         Источник.Дата);
		ДанныеРеестра.Вставить("Company",      Строка(Источник.Организация));
		ДанныеРеестра.Вставить("Comment",      Источник.Комментарий);
		ДанныеРеестра.Вставить("Applications", Новый Массив);
		Для каждого СтрокаРеестр Из Источник.ОбъектВизирования.ТаблицаПлатежи Цикл
			Имена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(СтрокаРеестр.ЗаявкаПлатежнаяПозиция.Метаданные().ПолноеИмя());
			СтрокаЗаявки = Новый Структура;
			СтрокаЗаявки.Вставить("RowNumber",               СтрокаРеестр.НомерСтроки);
			СтрокаЗаявки.Вставить("ObjectName",              Имена.ИмяОбъекта);
			СтрокаЗаявки.Вставить("ApplicationID",           XMLСтрока(СтрокаРеестр.ЗаявкаПлатежнаяПозиция));
			СтрокаЗаявки.Вставить("ApplicationPresentation", Строка(СтрокаРеестр.ЗаявкаПлатежнаяПозиция));
			СтрокаЗаявки.Вставить("Amount",                  Формат(СтрокаРеестр.СуммаКОплате, "ЧН=0; ЧГ="));
			СтрокаЗаявки.Вставить("AmountPayable",           Формат(СтрокаРеестр.СуммаКОплате, "ЧН=0; ЧГ="));
			СтрокаЗаявки.Вставить("TotalSchedule",           Формат(СтрокаРеестр.СуммаПлан, "ЧН=0; ЧГ="));
			СтрокаЗаявки.Вставить("Currency",                Строка(СтрокаРеестр.ВалютаПлатежа));
			ДанныеРеестра.Applications.Добавить(СтрокаЗаявки);
		КонецЦикла; 
		ОбъектВизирования.ApplicationReestr = ДанныеРеестра;
	КонецЕсли;

КонецПроцедуры

Функция ДанныеОбъекта(ОбъектСсылка) Экспорт
	
	ОбработкаОбъект = Обработки.бит_ИнформационнаяПанель.Создать();
	ОбработкаОбъект.Объект = ОбъектСсылка;
	ДеревоИнформация = Неопределено;
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		ДеревоИнформация = ОбработкаОбъект.ПолучитьИнформациюПоЗаявке();
	КонецЕсли;
	
	Возврат ДеревоИнформация;

КонецФункции 

Функция ЗапросПлатежнойПозиции() Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлатежнаяПозиция.ДатаПлан КАК ДатаПлан
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|ГДЕ
	|	ПлатежнаяПозиция.ДокументПланирования = &ДокументПланирования
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПлан";
	
	Возврат Запрос;
	
КонецФункции

Процедура ИменаТабличныхЧастей(Объект, ИменаТабличныхЧастей) Экспорт
	
	Совместимо = Истина;
	
КонецПроцедуры

Процедура ПрикрепленныеФайлыПроектовДоговоров(ПрикрепленныеФайлы, СсылкиПоТипам) Экспорт
	
	Совместимо = Истина;
	
КонецПроцедуры

Функция ФильтрРеквизитовОбъекта(ОбъектСистемы) Экспорт
	
	Результат = Новый Массив;
	ОбъектВизирования = Справочники.бит_ОбъектыСистемы.ОбъектМетаданныхПоОбъектуСистемы(ОбъектСистемы);
	//Если ОбъектВизирования = Метаданные.Документы.бит_АктуализацияБюджета Тогда
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_БюджетнаяОперация Тогда
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ВерсияОтчета Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//ИначеЕсли ОбъектВизирования = Метаданные.Справочники.бит_ВнутренниеДокументы Тогда
	//	Результат.Добавить("ResponsiblePerson");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ДополнительныеУсловияПоДоговору Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("Contract");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_мто_ЗаявкаНаЗакупку Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("Contract");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("Executor");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ЗаявкаНаЗатраты Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("PaymentDate");
	//	Результат.Добавить("Contract");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("Executor");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_мдм_ЗаявкаНаИзменение Тогда
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_мто_ЗаявкаНаПотребность Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("Contract");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("Executor");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ЗаявкаНаРасходованиеСредств Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("PaymentDate");
	//	Результат.Добавить("Contract");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("Executor");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("BasisForecast");
	//	Результат.Добавить("ManagerialPurpose");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_мдм_ЗаявкаНаУдаление Тогда
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_КорректировкаБюджета Тогда
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_КорректировкаКонтрольныхЗначений Тогда
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ОперацияУправленческий Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ОтветНаЗапросНалоговогоМониторинга Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("Status");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ЗаявкаНаРасходованиеСредствОбщая Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("PaymentDate");
	//	Результат.Добавить("Contract");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("Executor");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("BasisForecast");
	//	Результат.Добавить("ManagerialPurpose");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ПроектДоговора Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ПротоколРасхожденийБюджета Тогда
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_РеестрПлатежей Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("TurnoverItem");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ВалютныйСвоп Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_СправкаОПодтверждающихДокументах Тогда
	//	Результат.Добавить("Company");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Status");
	//ИначеЕсли ОбъектВизирования = Метаданные.Документы.бит_ФормаВводаБюджета Тогда
	//	Результат.Добавить("Contract");
	//	Результат.Добавить("Partner");
	//	Результат.Добавить("ResponsiblePerson");
	//	Результат.Добавить("Project");
	//	Результат.Добавить("Status");
	//	Результат.Добавить("Scenario");
	//	Результат.Добавить("TurnoverItem");
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДанныеТабличнойЧасти(ОбъектСсылка, Результат) Экспорт
	
	Если ЗначениеЗаполнено(ОбъектСсылка)
		И ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_кзн_РеестрПлатежей") Тогда
		
		Попытка
			
			ЗаблокироватьДанныеДляРедактирования(ОбъектСсылка);
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыШапки.ВерсияДанных КАК ВерсияДанных,
			|	РеквизитыШапки.Организация КАК Организация
			|ИЗ
			|	Документ.бит_кзн_РеестрПлатежей КАК РеквизитыШапки
			|ГДЕ
			|	РеквизитыШапки.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Таблица.ЗаявкаПлатежнаяПозиция КАК Заявка,
			|	Таблица.ЗаявкаПлатежнаяПозиция.Номер КАК Номер,
			|	Таблица.ЗаявкаПлатежнаяПозиция.Дата КАК Дата,
			|	Таблица.Оплачено КАК Оплачено,
			|	Таблица.ФормаОплаты КАК ФормаОплаты,
			|	Таблица.Организация КАК Организация,
			|	Таблица.ПлатежнаяПозиция КАК ПлатежнаяПозиция,
			|	Таблица.ПлатежнаяПозиция.Номер КАК ПлатежнаяПозицияНомер,
			|	Таблица.ПлатежнаяПозиция.Дата КАК ПлатежнаяПозицияДата,
			|	Таблица.ВалютаДокумента КАК ВалютаДокумента,
			|	Таблица.СуммаДокумента КАК СуммаДокумента,
			|	Таблица.СуммаКОплате КАК СуммаКОплате,
			|	Таблица.ВалютаПлатежа КАК ВалютаПлатежа,
			|	Таблица.СуммаПлан КАК СуммаПлан,
			|	Таблица.СуммаОстаток КАК СуммаОстаток,
			|	Таблица.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	Документ.бит_кзн_РеестрПлатежей.ТаблицаПлатежи КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			РеестрПлатежей = РезультатЗапроса[0].Выбрать();
			Заявки = РезультатЗапроса[1].Выгрузить();
			
			ТипыСчетКасса = Новый Массив;
			ТипыСчетКасса.Добавить(Тип("СправочникСсылка.БанковскиеСчетаОрганизаций"));
			ТипыСчетКасса.Добавить(Тип("СправочникСсылка.Кассы"));
			ОписаниеТиповСчетКасса = Новый ОписаниеТипов(ТипыСчетКасса);

			Заявки.Колонки.Добавить("СчетКасса",          		ОписаниеТиповСчетКасса);
			Заявки.Колонки.Добавить("ПозицияПроведен",          Новый ОписаниеТипов("Булево"));
			Заявки.Колонки.Добавить("СтатусЗаявки",             Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
			Заявки.Колонки.Добавить("СостояниеОплаты",          Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
			Заявки.Колонки.Добавить("СтатусЗаявкиПравильный",   Новый ОписаниеТипов("Булево"));
			Заявки.Колонки.Добавить("ПлатежныйДокумент",        Документы.ТипВсеСсылки());
			
			//Заявки.Колонки.Добавить("ЗаявкаКонтрагент",         Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
			//Заявки.Колонки.Добавить("ЗаявкаДоговорКонтрагента", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
			//Заявки.Колонки.Добавить("ЗаявкаПроект",             Новый ОписаниеТипов("СправочникСсылка.Проекты"));
			
			Если РеестрПлатежей.Следующий() Тогда
				
				ПлатежныеПозиции = Заявки.ВыгрузитьКолонку("ПлатежнаяПозиция");
				ДатаОплаты = ТекущаяДатаСеанса();
				ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
				ДанныеПозиций = Документы.бит_кзн_РеестрПлатежей.ДанныеПлатежныхПозиций(ПлатежныеПозиции,
				    ВалютаРегламентированногоУчета, ДатаОплаты, РеестрПлатежей.Организация);
				
				Результат.Version = РеестрПлатежей.ВерсияДанных;
				
				СтрокиРеестра = Новый Массив;
				ШаблонДокумента = НСтр("ru = '%1 от %2'; en = '%1 от %2'", ОбщегоНазначения.КодОсновногоЯзыка());
				Для Каждого ТекущаяЗаявка Из Заявки Цикл
					
					ЗаполнитьДобавленныеКолонкиСтроки(ТекущаяЗаявка, ДанныеПозиций);
					
					ДанныеСтроки = НовыйПараметрыСтроки();
					ДанныеСтроки.LineNumber    = ТекущаяЗаявка.НомерСтроки;
					ДанныеСтроки.ID            = XMLСтрока(ТекущаяЗаявка.Заявка);
					ДанныеСтроки.RequestName   = СтрШаблон(ШаблонДокумента, ТекущаяЗаявка.ПлатежнаяПозицияНомер, Формат(ТекущаяЗаявка.ПлатежнаяПозицияДата, "ДЛФ=D"));
					ДанныеСтроки.AmountPayable = ТекущаяЗаявка.СуммаОстаток;
					ДанныеСтроки.Currency      = Строка(ТекущаяЗаявка.ВалютаДокумента);
					ДанныеСтроки.Pay           = ТекущаяЗаявка.Оплачено;
					Если ТекущаяЗаявка.СтатусЗаявкиПравильный И ТекущаяЗаявка.СуммаОстаток <> 0 И НЕ ЗначениеЗаполнено(ТекущаяЗаявка.ПлатежныйДокумент) Тогда
						ДанныеСтроки.Editable = Истина;
					КонецЕсли;
					
					// Дополнительные свойства строки реестра (Аналитики).
					
					// Организация.
					Представление = НСтр("ru = 'Организация'; en = 'Organization'", ОбщегоНазначения.КодОсновногоЯзыка());
					Значение = Строка(ТекущаяЗаявка.Организация);
					АналитикаОрганизация = НоваяАналитикаСтроки(Представление, Значение);
					
					// Банковский счет организации.
					Представление = НСтр("ru = 'Счет / касса'; en = 'Сash account'", ОбщегоНазначения.КодОсновногоЯзыка());
					Значение = Строка(ТекущаяЗаявка.СчетКасса);
					АналитикаБанковскийСчетОрганизации = НоваяАналитикаСтроки(Представление, Значение);
					
					//// Контрагент.
					//Представление = НСтр("ru = 'Контрагент'; en = 'Partner'", ОбщегоНазначения.КодОсновногоЯзыка());
					//Значение = Строка(ТекущаяЗаявка.ЗаявкаКонтрагент);
					//АналитикаКонтрагент = НоваяАналитикаСтроки(Представление, Значение);
					//
					//// Договор контрагента.
					//Представление = НСтр("ru = 'Договор контрагента'; en = 'Contract'", ОбщегоНазначения.КодОсновногоЯзыка());
					//Значение = Строка(ТекущаяЗаявка.ЗаявкаДоговорКонтрагента);
					//АналитикаДоговорКонтрагента = НоваяАналитикаСтроки(Представление, Значение);
					//
					//// Проект.
					//Представление = НСтр("ru = 'Проект'; en = 'Project'", ОбщегоНазначения.КодОсновногоЯзыка());
					//Значение = Строка(ТекущаяЗаявка.ЗаявкаПроект);
					//АналитикаПроект = НоваяАналитикаСтроки(Представление, Значение);
					
					ДоплнительныеСвойства = Новый Массив;
					ДоплнительныеСвойства.Добавить(АналитикаОрганизация);
					ДоплнительныеСвойства.Добавить(АналитикаБанковскийСчетОрганизации);
					//ДоплнительныеСвойства.Добавить(АналитикаКонтрагент);
					//ДоплнительныеСвойства.Добавить(АналитикаДоговорКонтрагента);
					//ДоплнительныеСвойства.Добавить(АналитикаПроект);
					
					ДанныеСтроки.Aditional = ДоплнительныеСвойства;
					
					СтрокиРеестра.Добавить(ДанныеСтроки);
				КонецЦикла;
				
				Результат.Lines = СтрокиРеестра;
				
			КонецЕсли;
		Исключение
			Результат.ErrorMessage = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДанныеТабличнойЧасти(ОбъектСсылка, ДанныеЗапроса, Результат) Экспорт
	
	Версия = ДанныеЗапроса.Version;
	Заявки = ДанныеЗапроса.Lines;
	
	Если ЗначениеЗаполнено(ОбъектСсылка)
		И ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_кзн_РеестрПлатежей") Тогда
		
		Попытка
			// Блокировка и проверка, что версия документа не изменилась.
			ЗаблокироватьДанныеДляРедактирования(ОбъектСсылка, Версия);
			
			Реестр = ОбъектСсылка.ПолучитьОбъект();
			
			// Таблица проверки.
			КонтрольЗаявок = Реестр.ТаблицаПлатежи.Выгрузить();
			КонтрольЗаявок.Колонки.Добавить("ПозицияПроведен",          Новый ОписаниеТипов("Булево"));
			КонтрольЗаявок.Колонки.Добавить("СтатусЗаявки",             Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
			КонтрольЗаявок.Колонки.Добавить("СостояниеОплаты",          Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
			КонтрольЗаявок.Колонки.Добавить("СтатусЗаявкиПравильный",   Новый ОписаниеТипов("Булево"));
			
			// Подготовка параметров проверки.
			ПлатежныеПозиции = КонтрольЗаявок.ВыгрузитьКолонку("ПлатежнаяПозиция");
			ДатаОплаты = ТекущаяДатаСеанса();
			ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
			ДанныеПозиций = Документы.бит_кзн_РеестрПлатежей.ДанныеПлатежныхПозиций(ПлатежныеПозиции, ВалютаРегламентированногоУчета,
			    ДатаОплаты, Реестр.Организация);
			ШаблонДокумента = НСтр("ru = 'Строка №%1, %2;'; en = 'Line #%1, %2;'", ОбщегоНазначения.КодОсновногоЯзыка());
			
			СообщенияОбОшибках = Новый Массив;
			СообщенияОбОшибках.Добавить(НСтр("ru = 'Для некоторых строк не был измен статус ""В оплату"", так как он недоступен:';
			|en = 'For some lines, the “For payment” status was not changed because it is not available:'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
			ЗаписатьДокумент = Ложь;
			Для каждого СтрокаТЧ Из Заявки Цикл
				
				СтрокаПроверки = КонтрольЗаявок[СтрокаТЧ.LineNumber - 1];
				ЗаполнитьДобавленныеКолонкиСтроки(СтрокаПроверки, ДанныеПозиций);
				Если НЕ СтрокаПроверки.СтатусЗаявкиПравильный ИЛИ СтрокаПроверки.СуммаКОплате = 0 ИЛИ ЗначениеЗаполнено(СтрокаПроверки.ПлатежныйДокумент) Тогда
					Сообщение = СтрШаблон(ШаблонДокумента, СтрокаПроверки.НомерСтроки, СтрокаПроверки.Заявка);
					СообщенияОбОшибках.Добавить(Сообщение);
					Продолжить;
				КонецЕсли;
				
				ТекщаяСтрока = Реестр.ТаблицаПлатежи[СтрокаТЧ.LineNumber - 1];
				ТекщаяСтрока.Оплачено = СтрокаТЧ.Pay;
				ЗаписатьДокумент = Истина;
			КонецЦикла;
			
			// Информируем о проблемных строках и продолжаем запись.
			Если СообщенияОбОшибках.Количество() > 1 Тогда
				Результат.ErrorMessage = СтрСоединить(СообщенияОбОшибках, Символы.ПС);
			КонецЕсли;
			
			Если ЗаписатьДокумент Тогда
				Если Реестр.ПроверитьЗаполнение() Тогда
					Реестр.Записать();
				Иначе
					СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
					ВсеСообщенияПользователю = Новый Массив;
					Для каждого ТекущееСообщение Из СообщенияПользователю Цикл
						ВсеСообщенияПользователю.Добавить(ТекущееСообщение.Текст);
					КонецЦикла;
					ВсеСообщенияПользователю = СтрСоединить(ВсеСообщенияПользователю, Символы.ПС);
					
					ТекстСообщения = НСтр("ru = 'Документ не прошел проверку заполнения. По причине:
					    |%1';
					    |en = 'The document did not pass the completion check. For reason:
					    |%1'", ОбщегоНазначения.КодОсновногоЯзыка());
					Результат.ErrorMessage = СтрШаблон(ТекстСообщения, ВсеСообщенияПользователю);
				КонецЕсли;;
			КонецЕсли;
			
		Исключение
			Результат.ErrorMessage = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция HTMLРеестра(Ссылка)
	
	ОбъектыПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка);	
	ПечатнаяФорма = Документы.бит_кзн_РеестрПлатежей.СформироватьПечатнуюФормуРеестраПлатежей(ОбъектыПечати, Ложь, Истина);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
	ПечатнаяФорма.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML5);
	Файл = Новый ЧтениеТекста(ИмяВременногоФайла);
	Результат = Файл.Прочитать();
	Файл.Закрыть();
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ИмяСобытия = НСтр("ru = 'Попытка удалить временный файл'; en = 'Attempt to delete temporary file'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,
			ИмяВременногоФайла, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	// N.B. Требуется наличие пустых тегов, чтобы мобильное приложение показало данные таблицы.
	Результат = СтрЗаменить(Результат, "<TABLE", "<table><tr></tr></table><TABLE");
	
	Возврат Результат;
	
КонецФункции

Функция НовыйПараметрыСтроки()
	
	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("LineNumber",    "");
	ПараметрыСтроки.Вставить("ID",            "");
	ПараметрыСтроки.Вставить("RequestName",   "");
	ПараметрыСтроки.Вставить("AmountPayable", 0);
	ПараметрыСтроки.Вставить("Currency",      "");
	ПараметрыСтроки.Вставить("Pay",           Ложь);
	ПараметрыСтроки.Вставить("Editable",      Ложь);
	ПараметрыСтроки.Вставить("Aditional",     Новый Массив);
	
	Возврат ПараметрыСтроки;
	
КонецФункции

Процедура ЗаполнитьДобавленныеКолонкиСтроки(ТекущаяСтрока, ДанныеПозиций)
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ПлатежнаяПозиция) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПоиска = ДанныеПозиций.Найти(ТекущаяСтрока.ПлатежнаяПозиция, "ПлатежнаяПозиция");
	Если РезультатПоиска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Сумма = ТекущаяСтрока.СуммаДокумента;
	ПостоянныеСвойстваПозиций = Документы.бит_кзн_РеестрПлатежей.ПостоянныеСвойстваПозиций();
	ПостоянныеСвойстваПозиций = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ПостоянныеСвойстваПозиций, ",");
	Если ЗначениеЗаполнено(ТекущаяСтрока.ПлатежныйДокумент) Тогда
		ПостоянныеСвойстваПозиций = ПостоянныеСвойстваПозиций + ", СуммаОстаток, СуммаКОплате, СуммаПлан";
	Иначе
		ПостоянныеСвойстваПозиций = ПостоянныеСвойстваПозиций + ", СуммаОстаток";
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, РезультатПоиска,, ПостоянныеСвойстваПозиций);
	ТекущаяСтрока.СтатусЗаявкиПравильный = Документы.бит_кзн_РеестрПлатежей.СтатусЗаявкиПравильный(ТекущаяСтрока);
	
КонецПроцедуры

Функция НоваяАналитикаСтроки(Представление, Значение)
	
	Возврат Новый Структура("Key, Value", Представление, Значение);
	
КонецФункции

Функция HTMLЗаявки(Ссылка, ДопАналитики)
	
	Заголовок = Строка(Ссылка);
	
	Шапка =
	"<!DOCTYPE html>
	|<html>
	|<head>
	|<meta charset=""utf-8"">
	|<title>%1</title>
	|%2
	|<!--[if lt IE 9]>      
	|<script src=""http://html5shiv.googlecode.com/svn/trunk/html5.js""></script
	|<![endif]-->
	|</head>";

	Стили =
	"<style>
	|table {
	|  border-collapse: collapse; 
	|  line-height: 1.1;
	|  font-family: ""Lucida Sans Unicode"", ""Lucida Grande"", sans-serif;
	|  color: #0C213B;
	|}
	|th {
	|  padding: 10px; 
	|  border: 1px solid grey;
	|  background: lightgrey;
	|}
	|td {
	|  font-size: 0.8em;
	|  padding: 5px 7px;
	|  border: 1px solid grey;
	|}
	|</style>";	

	Шапка				= СтрШаблон(Шапка, Заголовок, Стили);
	ТелоHTMLДокумента	= "<body>" + Символы.ПС;
	
	ИсключитьСтолбцы	= Новый Массив;
	ИсключитьСтолбцы.Добавить("ИД");
	ИсключитьСтолбцы.Добавить("ИД_Прогноз");
	ИсключитьСтолбцы.Добавить("ИДВладельца");
	ИсключитьСтолбцы.Добавить("КоэффициентРаспределения");
	ИсключитьСтолбцы.Добавить("УдалитьНазначениеПлатежа");
	ИсключитьСтолбцы.Добавить("Расчетная");
	ИсключитьСтолбцы.Добавить("Удалить_Сценарий");
	ИсключитьСтолбцы.Добавить("Служебный");
	
	// Формируем заголовки.
	ТелоHTMLДокумента = ТелоHTMLДокумента + "<h2>" + Заголовок + "</h2>" + Символы.ПС;
	ТелоHTMLДокумента = ТелоHTMLДокумента + "<h3>" + "Платежи" + "</h3>" + Символы.ПС;	
	ТелоHTMLДокумента = ТелоHTMLДокумента + "<table>" + Символы.ПС;
	
	СтруктураТЧ = Новый Структура;
	СтруктураТЧ.Вставить("ДатаПлан",			НСтр("ru = 'Дата платежа'; en = 'Дата платежа'"));
	СтруктураТЧ.Вставить("ДатаПланКрайняя",		НСтр("ru = 'Не позднее'; en = 'Не позднее'"));
	СтруктураТЧ.Вставить("СуммаДокумента",		НСтр("ru = 'Сумма платежа'; en = 'Сумма платежа'"));
	СтруктураТЧ.Вставить("Контрагент",			НСтр("ru = 'Контрагент'; en = 'Контрагент'"));
	СтруктураТЧ.Вставить("ЦФО",					НСтр("ru = 'ЦФО'; en = 'ЦФО'"));
	СтруктураТЧ.Вставить("СтатьяОборотов",		НСтр("ru = 'Статья оборотов'; en = 'Статья оборотов'"));
	СтруктураТЧ.Вставить("БанковскийСчет",		НСтр("ru = 'Банковский счет'; en = 'Банковский счет'"));
	СтруктураТЧ.Вставить("Касса",				НСтр("ru = 'Касса'; en = 'Касса'"));
	СтруктураТЧ.Вставить("Аналитика_1",			НСтр("ru = 'Аналитика_1'; en = 'Аналитика_1'"));
	СтруктураТЧ.Вставить("Аналитика_2",			НСтр("ru = 'Аналитика_2'; en = 'Аналитика_2'"));
	СтруктураТЧ.Вставить("Аналитика_3",			НСтр("ru = 'Аналитика_3'; en = 'Аналитика_3'"));
	СтруктураТЧ.Вставить("Аналитика_4",			НСтр("ru = 'Аналитика_4'; en = 'Аналитика_4'"));
	СтруктураТЧ.Вставить("Аналитика_5",			НСтр("ru = 'Аналитика_5'; en = 'Аналитика_5'"));
	СтруктураТЧ.Вставить("Аналитика_6",			НСтр("ru = 'Аналитика_6'; en = 'Аналитика_6'"));
	СтруктураТЧ.Вставить("Аналитика_7",			НСтр("ru = 'Аналитика_7'; en = 'Аналитика_7'"));
	СтруктураТЧ.Вставить("Аналитика_8",			НСтр("ru = 'Аналитика_8'; en = 'Аналитика_8'"));
	СтруктураТЧ.Вставить("Аналитика_9",			НСтр("ru = 'Аналитика_9'; en = 'Аналитика_9'"));
	СтруктураТЧ.Вставить("Аналитика_10",		НСтр("ru = 'Аналитика_10'; en = 'Аналитика_10'"));
	СтруктураТЧ.Вставить("Аналитика_11",		НСтр("ru = 'Аналитика_11'; en = 'Аналитика_11'"));
	СтруктураТЧ.Вставить("Аналитика_12",		НСтр("ru = 'Аналитика_12'; en = 'Аналитика_12'"));
	СтруктураТЧ.Вставить("СверхБюджета",		НСтр("ru = 'Сверх бюджета'; en = 'Сверх бюджета'"));
	СтруктураТЧ.Вставить("Дата",				НСтр("ru = 'Дата'; en = 'Дата'"));
	СтруктураТЧ.Вставить("Номер",				НСтр("ru = 'Номер'; en = 'Номер'"));
	СтруктураТЧ.Вставить("Ответственный",		НСтр("ru = 'Ответственный'; en = 'Ответственный'"));
	СтруктураТЧ.Вставить("ВидПлана",			НСтр("ru = 'Вид плана'; en = 'Вид плана'"));
	СтруктураТЧ.Вставить("ВалютаДокумента",		НСтр("ru = 'Валюта'; en = 'Валюта'"));
	СтруктураТЧ.Вставить("Статус",				НСтр("ru = 'Статус'; en = 'Статус'"));
	СтруктураТЧ.Вставить("ДатаИзмененияСтатуса",НСтр("ru = 'Дата изменения статуса'; en = 'Дата изменения статуса'"));
	СтруктураТЧ.Вставить("ПометкаУдаления",		НСтр("ru = 'Пометка удаления'; en = 'Пометка удаления'"));
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТабДок.ДатаПлан КАК ДатаПлан,
	|	ТабДок.ДатаПланКрайняя КАК ДатаПланКрайняя,
	|	ТабДок.СуммаДокумента КАК СуммаДокумента,
	|	ТабДок.Контрагент КАК Контрагент,
	|	ТабДок.ЦФО КАК ЦФО,
	|	ТабДок.СтатьяОборотов КАК СтатьяОборотов,
	|	ТабДок.БанковскийСчет КАК БанковскийСчет,
	|	ТабДок.Касса КАК Касса,
	|	ТабДок.Аналитика_1 КАК Аналитика_1,
	|	ТабДок.Аналитика_2 КАК Аналитика_2,
	|	ТабДок.Аналитика_3 КАК Аналитика_3,
	|	ТабДок.Аналитика_4 КАК Аналитика_4,
	|	ТабДок.Аналитика_5 КАК Аналитика_5,
	|	ТабДок.Аналитика_6 КАК Аналитика_6,
	|	ТабДок.Аналитика_7 КАК Аналитика_7,
	|	ТабДок.Аналитика_8 КАК Аналитика_8,
	|	ТабДок.Аналитика_9 КАК Аналитика_9,
	|	ТабДок.Аналитика_10 КАК Аналитика_10,
	|	ТабДок.Аналитика_11 КАК Аналитика_11,
	|	ТабДок.Аналитика_12 КАК Аналитика_12,
	|	ТабДок.СверхБюджета КАК СверхБюджета,
	|	ТабДок.Дата КАК Дата,
	|	ТабДок.Номер КАК Номер,
	|	ТабДок.Ответственный КАК Ответственный,
	|	ТабДок.ВидПлана КАК ВидПлана,
	|	ТабДок.ВалютаДокумента КАК ВалютаДокумента,
	|	ТабСтатусы.Статус КАК Статус,
	|	ТабСтатусы.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
	|	ТабДок.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	&ТабДок КАК ТабДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК ТабСтатусы
	|		ПО ТабДок.Ссылка = ТабСтатусы.Объект
	|			И (ТабСтатусы.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус))
	|ГДЕ
	|	ТабДок.ДокументПланирования = &ДокументПланирования";
	
	Если ТипЗнч(Ссылка) = ТИп("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "&ТабДок", "Документ.бит_кзн_ПлатежнаяПозиция");
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "&ТабДок", "Документ.бит_кзн_ПозицияПоступления");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "ТабДок.СверхБюджета КАК СверхБюджета,", "");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка	= РезультатЗапроса.Выбрать();
	
	// Формируем заголовок табличной части.
	ЗаголовокТаблицы	= "<tr>" + Символы.ПС;
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл			
		Если НЕ ИсключитьСтолбцы.Найти(Колонка.Имя) = Неопределено Тогда
			Продолжить;				
		КонецЕсли;
		// Игнорируем столбцы, оканчивающиеся на "_Старый" 
		Если НЕ СтрНайти(Колонка.Имя, "_Старый") = 0 Тогда
			Продолжить;	
		КонецЕсли;
		ИмяКолонки = СтруктураТЧ[Колонка.Имя];
		НайденнаяАналитика = Неопределено;
		ДопАналитики.Свойство(Колонка.Имя, НайденнаяАналитика);
		Если НЕ НайденнаяАналитика = Неопределено Тогда
			Если НайденнаяАналитика.Используется Тогда
				ИмяКолонки	= НайденнаяАналитика.Синоним;					
			Иначе
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		ЗаголовокТаблицы = ЗаголовокТаблицы + "<th>" + ИмяКолонки + "</th>" + Символы.ПС;			
	КонецЦикла;
	
	ЗаголовокТаблицы	= ЗаголовокТаблицы + "</tr>" + Символы.ПС;
	ТелоHTMLДокумента	= ТелоHTMLДокумента + ЗаголовокТаблицы;
	
	// Формируем данные табличной части.
	ДанныеТаблицы = "";
	Пока Выборка.Следующий() Цикл
		ДанныеТаблицы	= ДанныеТаблицы + "<tr>" + Символы.ПС;
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Если НЕ ИсключитьСтолбцы.Найти(Колонка.Имя) = Неопределено Тогда
				Продолжить;				
			КонецЕсли;
			// Игнорируем столбцы, оканчивающиеся на "_Старый". 
			Если НЕ СтрНайти(Колонка.Имя, "_Старый") = 0 Тогда
				Продолжить;	
			КонецЕсли;
			НайденнаяАналитика	= Неопределено;
			ДопАналитики.Свойство(Колонка.Имя, НайденнаяАналитика);
			Если НЕ НайденнаяАналитика = Неопределено И НЕ НайденнаяАналитика.Используется Тогда
				Продолжить;	
			КонецЕсли;
			ДанныеКолонки	= Выборка[Колонка.Имя];				
			ДанныеТаблицы	= ДанныеТаблицы + "<td>" + Строка(ДанныеКолонки) + "</td>" + Символы.ПС;			
		КонецЦикла;
		ДанныеТаблицы	= ДанныеТаблицы + "</tr>" + Символы.ПС;
	КонецЦикла;
	
	ТелоHTMLДокумента = ТелоHTMLДокумента + ДанныеТаблицы;		
	ТелоHTMLДокумента = ТелоHTMLДокумента + "</table>" + Символы.ПС;
	ТелоHTMLДокумента = ТелоHTMLДокумента + "</br>" + Символы.ПС;
 	ТелоHTMLДокумента = ТелоHTMLДокумента + "</body>" + Символы.ПС + "</html>";

	Результат = Шапка + Символы.ПС + ТелоHTMLДокумента;
	
	Возврат Результат
	
КонецФункции

#КонецОбласти
